---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedNumberColumns
source: html/dffe7a6d-4876-1f6b-b4c5-1b5bddd53405.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewGraphSchedNumberColumns Property

"Column Locations per Segment"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewGraphSchedNumberColumns { get; }
```